---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.UnsetAttribute(System.String)
source: html/a7877fdd-1aff-cbd4-27a4-670cb227e728.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.UnsetAttribute Method

Unsets the attribute value.

## Syntax (C#)
```csharp
public void UnsetAttribute(
	string name
)
```

## Parameters
- **name** (`System.String`) - The attribute name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null